"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие
лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого
предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее
количество занятий по нему. Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""
import re

my_dict = {}
with open('6.txt', 'r', encoding='utf-8') as f:
    for line in f:
        summa = 0
        my_list = re.split('[( ]', line)  # использую несколько разделителей с модулем re (пробел и '(' )
        for el in my_list:
            try:  # преобразовываем элементы списка в числах которые возможно
                number = int(el)
                summa += number
            except ValueError:
                continue
        my_dict.update({my_list[0]: summa})
print(my_dict)
